RT-Thread/rt-thread/bsp/nrf52832/nRF5_SDK_13.0.0_04a0bfd/components/drivers_nrf/usbd/nrf_drv_usbd.c
            STATIC_ASSERT(offsetof(usbd_drv_ep_state_t, handler.feeder) ==
                offsetof(usbd_drv_ep_state_t, handler.consumer));
            ASSERT((p_state->handler.feeder) != NULL);

            if (NRF_USBD_EPIN_CHECK(ep))
            {
                /* Device -> Host */
                continue_transfer = p_state->handler.feeder(
                    &transfer,
                    p_state->p_context,
                    p_state->max_packet_size);

                if (!continue_transfer)
                {
                    p_state->handler.feeder = NULL;
                    if (ep == NRF_DRV_USBD_EPIN0)
                    {
                        /** Configure short right now - now if the last data is transferred,
                         *   when host tries another data transfer, the endpoint will stall. */
                        NRF_LOG_DEBUG("USB DMA process: Enable status short\r\n");
                        nrf_usbd_shorts_enable(NRF_USBD_SHORT_EP0DATADONE_EP0STATUS_MASK);
                    }
                }
            }
            else
            {
                /* Host -> Device */
                const size_t rx_size = nrf_drv_usbd_epout_size_get(ep);
                continue_transfer = p_state->handler.consumer(
                    &transfer,
                    p_state->p_context,
                    p_state->max_packet_size,
                    rx_size);

                if (transfer.p_data.rx == NULL)
                {
                    /* Dropping transfer - allow processing */
                    ASSERT(transfer.size == 0);
                }
                else if (transfer.size < rx_size)
                {
                    p_state->status = NRF_USBD_EP_OVERLOAD;
                    UNUSED_RETURN_VALUE(nrf_atomic_u32_and(&m_ep_dma_waiting, ~(1U<<pos)));
                    NRF_DRV_USBD_EP_TRANSFER_EVENT(evt, ep, NRF_USBD_EP_OVERLOAD);
                    m_event_handler(&evt);
                    /* This endpoint will not be transmitted now, repeat the loop */
                    continue;
                }
                else
                {
                    /* Nothing to do */
                }
                if (!continue_transfer)
                {
                    p_state->handler.consumer = NULL;
                }
                ASSERT(transfer.size == rx_size);
            }

            m_dma_pending = 1;
            m_ep_ready &= ~(1U << pos);
            if (NRF_USBD_ISO_DEBUG || (!NRF_USBD_EPISO_CHECK(ep)))
            {
                NRF_LOG_DEBUG(
                    "USB DMA process: Starting transfer on EP: %x, size: %u\r\n",
                    ep,
                    transfer.size);
            }
            /* Update number of currently transferred bytes */
            p_state->transfer_cnt += transfer.size;
            /* Start transfer to the endpoint buffer */
            nrf_usbd_ep_easydma_set(ep, transfer.p_data.ptr, (uint32_t)transfer.size);

#if NRF_DRV_USBD_PROTO1_FIX
            uint32_t cnt_end = (uint32_t)(-1);
            do
            {
                uint32_t cnt = (uint32_t)(-1);
                do
                {
                    nrf_usbd_event_clear(NRF_USBD_EVENT_STARTED);
                    usbd_dma_start(ep);
                    nrf_drv_systick_delay_us(2);
                    ++cnt;
                }while (!nrf_usbd_event_check(NRF_USBD_EVENT_STARTED));
                if (cnt)
                {
                    NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   DMA restarted: %u times\r\n", cnt);
                }

                nrf_drv_systick_delay_us(20);
                while (0 == (0x20 & *((volatile uint32_t *)(NRF_USBD_BASE + 0x474))))
                {
                    nrf_drv_systick_delay_us(2);
                }
                nrf_drv_systick_delay_us(1);

                ++cnt_end;
            } while (!nrf_usbd_event_check(nrf_drv_usbd_ep_to_endevent(ep)));
            if (cnt_end)
            {
                NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   DMA fully restarted: %u times\r\n", cnt_end);
            }
#else
            usbd_dma_start(ep);
#endif
            if (NRF_USBD_DMAREQ_PROCESS_DEBUG)
            {
                NRF_LOG_DEBUG("USB DMA process - finishing\r\n");
            }
            /* Transfer started - exit the loop */
            break;
        }
    }
    else
    {
        if (NRF_USBD_DMAREQ_PROCESS_DEBUG)
        {
            NRF_LOG_DEBUG("USB DMA process - EasyDMA busy\r\n");
        }
    }
}
/** @} */

typedef void (*nrf_drv_usbd_isr_t)(void);

/**
 * @brief USBD interrupt service runtimes
 *
 */
static const nrf_drv_usbd_isr_t m_isr[] =
{
    [USBD_INTEN_USBRESET_Pos   ] = USBD_ISR_Usbreset,
    [USBD_INTEN_STARTED_Pos    ] = USBD_ISR_Started,
    [USBD_INTEN_ENDEPIN0_Pos   ] = USBD_ISR_dma_epin0,
    [USBD_INTEN_ENDEPIN1_Pos   ] = USBD_ISR_dma_epin1,
    [USBD_INTEN_ENDEPIN2_Pos   ] = USBD_ISR_dma_epin2,
    [USBD_INTEN_ENDEPIN3_Pos   ] = USBD_ISR_dma_epin3,
    [USBD_INTEN_ENDEPIN4_Pos   ] = USBD_ISR_dma_epin4,
    [USBD_INTEN_ENDEPIN5_Pos   ] = USBD_ISR_dma_epin5,
    [USBD_INTEN_ENDEPIN6_Pos   ] = USBD_ISR_dma_epin6,
    [USBD_INTEN_ENDEPIN7_Pos   ] = USBD_ISR_dma_epin7,
    [USBD_INTEN_EP0DATADONE_Pos] = USBD_ISR_SetupData,
    [USBD_INTEN_ENDISOIN_Pos   ] = USBD_ISR_dma_epin8,
    [USBD_INTEN_ENDEPOUT0_Pos  ] = USBD_ISR_dma_epout0,
    [USBD_INTEN_ENDEPOUT1_Pos  ] = USBD_ISR_dma_epout1,
    [USBD_INTEN_ENDEPOUT2_Pos  ] = USBD_ISR_dma_epout2,
    [USBD_INTEN_ENDEPOUT3_Pos  ] = USBD_ISR_dma_epout3,
    [USBD_INTEN_ENDEPOUT4_Pos  ] = USBD_ISR_dma_epout4,
    [USBD_INTEN_ENDEPOUT5_Pos  ] = USBD_ISR_dma_epout5,
    [USBD_INTEN_ENDEPOUT6_Pos  ] = USBD_ISR_dma_epout6,
    [USBD_INTEN_ENDEPOUT7_Pos  ] = USBD_ISR_dma_epout7,
    [USBD_INTEN_ENDISOOUT_Pos  ] = USBD_ISR_dma_epout8,
    [USBD_INTEN_SOF_Pos        ] = USBD_ISR_Sof,
    [USBD_INTEN_USBEVENT_Pos   ] = USBD_ISR_Event,
    [USBD_INTEN_EP0SETUP_Pos   ] = USBD_ISR_Setup,
    [USBD_INTEN_EPDATA_Pos     ] = USBD_ISR_EpDataStatus,
    [USBD_INTEN_ACCESSFAULT_Pos] = USBD_ISR_AccessFault
};

/**
 * @name Interrupt handlers
 *
 * @{
 */
void USBD_IRQHandler(void)
{
    const uint32_t enabled = nrf_usbd_int_enable_get();
    uint32_t to_process = enabled;
    uint32_t active = 0;

    /* Check all enabled interrupts */
    while (to_process)
    {
        uint8_t event_nr = __CLZ(__RBIT(to_process));
        if (nrf_usbd_event_get_and_clear((nrf_usbd_event_t)nrf_drv_bitpos_to_event(event_nr)))
        {
            active |= 1UL << event_nr;
        }
        to_process &= ~(1UL << event_nr);
    }

#if NRF_DRV_USBD_PROTO1_FIX
    /* Event correcting */
    if ((0 == m_dma_pending) && (0 != (active & (USBD_INTEN_SOF_Msk))))
    {
        uint8_t usbi, uoi, uii;
        /* Testing */
        *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7A9;
        uii = (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
        if (0 != uii)
        {
            uii &= (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
        }

        *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AA;
        uoi = (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
        if (0 != uoi)
        {
            uoi &= (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
        }
        *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AB;
        usbi = (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
        if (0 != usbi)
        {
            usbi &= (uint8_t)(*((volatile uint32_t *)(NRF_USBD_BASE + 0x804)));
        }
        /* Processing */
        *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7AC;
        uii &= (uint8_t)*((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
        if (0 != uii)
        {
            uint8_t rb;
            m_simulated_dataepstatus |= ((uint32_t)uii)<<USBD_EPIN_BITPOS_0;
            *((volatile uint32_t *)(NRF_USBD_BASE + 0x800)) = 0x7A9;
            *((volatile uint32_t *)(NRF_USBD_BASE + 0x804)) = uii;
            rb = (uint8_t)*((volatile uint32_t *)(NRF_USBD_BASE + 0x804));
            UNUSED_VARIABLE(rb);
            NRF_DRV_USBD_LOG_PROTO1_FIX_PRINTF("   uii: 0x%.2x (0x%.2x)\r\n", uii, rb);
        }

